# Dummy Variables & One Hot Encoding / Label Encoding

In [22]:
import pandas as pd

In [23]:
df = pd.read_csv("homeprice.csv")
df.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [24]:
# imp label count
df['town'].value_counts()

monroe township    5
west windsor       4
robinsville        4
Name: town, dtype: int64

In [25]:
from sklearn.preprocessing import LabelEncoder
label = LabelEncoder()

In [26]:
labels = label.fit_transform(df.town)

In [27]:
df['target']=labels

In [28]:
df

               town  area   price  target
0   monroe township  2600  550000       0
1   monroe township  3000  565000       0
2   monroe township  3200  610000       0
3   monroe township  3600  680000       0
4   monroe township  4000  725000       0
5      west windsor  2600  585000       2
6      west windsor  2800  615000       2
7      west windsor  3300  650000       2
8      west windsor  3600  710000       2
9       robinsville  2600  575000       1
10      robinsville  2900  600000       1
11      robinsville  3100  620000       1
12      robinsville  3600  695000       1

- monroe township ----> 0
- robinsville	  ----> 1
- west windsor    ----> 2

In [29]:
df = df.drop(["town"],axis='columns')

In [30]:
df.head()

   area   price  target
0  2600  550000       0
1  3000  565000       0
2  3200  610000       0
3  3600  680000       0
4  4000  725000       0

In [31]:
X = df.drop('price',axis='columns')
X

    area  target
0   2600       0
1   3000       0
2   3200       0
3   3600       0
4   4000       0
5   2600       2
6   2800       2
7   3300       2
8   3600       2
9   2600       1
10  2900       1
11  3100       1
12  3600       1

In [32]:
y = df['price']
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [33]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [34]:
model.fit(X,y)

LinearRegression()

In [35]:
model.score(X,y)

0.9552018104317441

In [37]:
model.predict([[3400,1]])

c:\Users\DEVARSHI SHAH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([662776.40384056])

In [38]:
model.predict([[3400,0]])

c:\Users\DEVARSHI SHAH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([642663.66016875])

In [39]:
model.predict([[3400,2]])

c:\Users\DEVARSHI SHAH\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([682889.14751237])